# This Python file uses the following encoding: utf-8
import json
from pathlib import Path
from wordcloud import WordCloud
from matplotlib import pyplot as plt
CN_punctuations = "，。（）、﹑！：﹕‘’ “” ；﹗？?﹖"

def process_CN1():
    cn1_path = Path("texts/CN1.txt")
    assert cn1_path.is_file()

    with cn1_path.open() as f:
        lines = f.readlines()

    pure_text_string = ""
    for index, line in enumerate(lines):
        if "德" in line:
            print(line)
        line = line.strip()
        first_space_idx = line.find(" ")
        line = line[first_space_idx+1:]
        lines[index] = line

        for char in line:
            if char not in CN_punctuations:
                pure_text_string += char

    print(pure_text_string)

    frequency_map = {}
    for token in pure_text_string:
        if token in frequency_map:
            frequency_map[token] += 1
        else:
            frequency_map[token] = 1

    print(f"Total word count: {len(pure_text_string)}")
    print(f"Unique word count: {len(frequency_map.keys())}")

    sorted_keys = sorted(frequency_map.keys(), key=lambda x: frequency_map[x], reverse=True)
    for i in range(30):
        print(f"{sorted_keys[i]} : {frequency_map[sorted_keys[i]]}")


    ## word cloud 
    # xxx = u"道可道非常道名可名非常名無名天地之始有名萬物之母故常無慾以觀其妙常有欲以觀其徼此兩者同出而異名同謂之玄玄之又玄衆妙之門天下皆知美之爲美斯惡已皆知善之爲善斯不善已故有無相生難易相成長短相較高下相傾音聲相和前後相隨是以聖人處無爲之事行不言之教萬物作焉而不辭生而不有爲而不恃功成而弗居夫唯弗居是以弗去不尚賢使民不爭不貴難得之貨使民不爲盜不見可欲使民心不亂是以聖人之治虛其心實其腹弱其志強其骨常使民無知無慾使夫智者不敢爲也爲無爲則無不治道衝而用之或不盈淵兮似萬物之宗挫其銳解其紛和其光同其塵湛兮似或存吾不知誰之子象帝之先天地不仁以萬物爲芻狗聖人不仁以百姓爲芻狗天地之間其猶橐龠乎虛而不屈動而愈出多言數窮不如守中谷神不死是謂玄牝玄牝之門是謂天地根綿綿若存用之不勤天長地久天地所以能長且久者以其不自生故能長生是以聖人後其身而身先外其身而身存非以其無私邪故能成其私上善若水水善利萬物而不爭處衆人之所惡故幾於道居善地心善淵與善仁言善信正善治事善能動善時夫唯不爭故無尤持而盈之不如其已揣而梲之不可長保金玉滿堂莫之能守不若其已富貴而驕自遺其咎功成身退天之道也載營魄抱一能無離乎摶氣致柔能嬰兒乎滌除玄覽能無疵乎愛國治民能無知乎天門開闔能爲雌乎明白四達能無爲乎生之畜之生而不有爲而不恃長而不宰是謂玄德三十輻共一轂當其無有車之用埏埴以爲器當其無有器之用鑿戶牖以爲室當其無有室之用故有之以爲利無之以爲用五色令人目盲五音令人耳聾五味令人口爽馳騁畋獵令人心發狂難得之貨令人行妨是以聖人爲腹不爲目故去彼取此寵辱若驚貴大患若身何謂寵辱若驚寵爲下得之若驚失之若驚是謂寵辱若驚何謂貴大患若身吾所以有大患者爲吾有身及吾無身吾有何患故貴以身爲天下若可寄天下愛以身爲天下若可託天下視之不見名曰夷聽之不聞名曰希搏之不得名曰微此三者不可致詰故混而爲一其上不皦其下不昧繩繩不可名復歸於無物是謂無狀之狀無物之象是謂惚恍迎之不見其首隨之不見其後執古之道以御今之有能知古始是謂道紀古之善爲士者微妙玄通深不可識夫唯不可識故強爲之容豫兮若冬涉川猶兮若畏四鄰儼兮其若客渙兮若冰之將釋敦兮其若樸曠兮其若谷渾兮其若濁孰能濁以靜之徐清孰能安以久動之徐生保此道者不欲盈夫唯不盈故能蔽不新成致虛極守靜篤萬物並作吾以觀復夫物芸芸各復歸其根歸根曰靜是曰覆命覆命曰常知常曰明不知常妄作兇知常容容乃公公乃王王乃天天乃道道乃久沒身不殆大上下知有之其次親而譽之其次畏之其次侮之信不足焉有不信焉悠兮其貴言功成事遂百姓皆謂我自然大道廢有仁義智慧出有大僞六親不和有孝慈國家昏亂有忠臣絕聖棄智民利百倍絕仁棄義民復孝慈絕巧棄利盜賊無有此三者以爲文不足故令有所屬見素抱樸少私寡慾絕學無憂唯之與阿相去幾何善之與惡相去若何人之所畏不可不畏荒兮其未央哉衆人熙熙如享太牢如春登臺我獨泊兮其未兆如嬰兒之未孩儽儽兮若無所歸衆人皆有餘而我獨若遺我愚人之心也哉沌沌兮俗人昭昭我獨若昏俗人察察我獨悶悶澹兮其若海飂兮若無止衆人皆有以而我獨頑似鄙我獨欲異於人而貴食母孔德之容惟道是從道之爲物惟恍惟惚惚兮恍兮其中有象恍兮惚兮其中有物窈兮冥兮其中有精其精甚真其中有信自今及古其名不去以閱衆甫吾何以知衆甫之狀哉以此曲則全枉則直窪則盈敝則新少則得多則惑是以聖人抱一爲天下式不自見故明不自是故彰不自伐故有功不自矜故長夫唯不爭故天下莫能與之爭古之所謂曲則全者豈虛言哉誠全而歸之希言自然故飄風不終朝驟雨不終日孰爲此者天地天地尚不能久而況於人乎故從事於道者道者同於道德者同於德失者同於失同於道者道亦樂得之同於德者德亦樂得之同於失者失亦樂得之信不足焉有不信焉企者不立跨者不行自見者不明自是者不彰自伐者無功自矜者不長其在道也曰餘食贅行物或惡之故有道者不處有物混成先天地生寂兮寥兮獨立而不改周行而不殆可以爲天下母吾不知其名字之曰道強爲之名曰大大曰逝逝曰遠遠曰反故道大天大地大王亦大域中有四大而王居其一焉人法地地法天天法道道法自然重爲輕根靜爲躁君是以聖人終日行不離輜重雖有榮觀燕處超然奈何萬乘之主而以身輕天下輕則失本躁則失君善行無轍跡善言無瑕謫善數不用籌策善閉無關楗而不可開善結無繩約而不可解是以聖人常善救人故無棄人常善救物故無棄物是謂襲明故善人者不善人之師不善人者善人之資不貴其師不愛其資雖智大迷是謂要妙知其雄守其雌爲天下溪爲天下溪常德不離復歸於嬰兒知其白守其黑爲天下式爲天下式常德不忒復歸於無極知其榮守其辱爲天下谷常德乃足復歸於樸樸散則爲器聖人用之則爲官長故大制不割將欲取天下而爲之吾見其不得已天下神器不可爲也爲者敗之執者失之故物或行或隨或歔或吹或強或羸或挫或隳是以聖人去甚去奢去泰以道佐人主者不以兵強天下其事好還師之所處荊棘生焉大軍之後必有凶年善者果而已不以取強果而勿矜果而勿伐果而勿驕果而不得已果而勿強物壯則老是謂不道不道早已夫佳兵者不祥之器物或惡之故有道者不處君子居則貴左用兵則貴右兵者不祥之器非君子之器不得已而用之恬淡爲上勝而不美而美之者是樂殺人夫樂殺人者則不可以得志於天下矣吉事尚左凶事尚右偏將軍居左上將軍居右言以喪禮處之殺人之衆以哀悲泣之戰勝以喪禮處之道常無名樸雖小天下莫能臣也侯王若能守之萬物將自賓天地相合以降甘露民莫之令而自均始制有名名亦既有夫亦將知止知止所以不殆譬道之在天下猶川穀之於江海知人者智自知者明勝人者有力自勝者強知足者富強行者有志不失其所者久死而不亡者壽大道氾兮其可左右萬物恃之而生而不辭功成不名有衣養萬物而不爲主常無慾可名於小萬物歸焉而不爲主可名爲大聖人之能成其大也以其終不自爲大故能成其大執大象天下往往而不害安平太樂與餌過客止道之出口淡乎其無味視之不足見聽之不足聞用之不可既將欲歙之必固張之將欲弱之必固強之將欲廢之必固興之將欲奪之必固與之是謂微明柔弱勝剛強魚不可脫於淵國之利器不可以示人道常無爲而無不爲侯王若能守之萬物將自化化而欲作吾將鎮之以無名之樸無名之樸夫亦將無慾不欲以靜天下將自定上德不德是以有德下德不失德是以無德上德無爲而無以爲下德爲之而有以爲上仁爲之而無以爲上義爲之而有以爲上禮爲之而莫之應則攘臂而扔之故失道而後德失德而後仁失仁而後義失義而後禮夫禮者忠信之薄而亂之首前識者道之華而愚之始是以大丈夫處其厚不居其薄處其實不居其華故去彼取此昔之得一者天得一以清地得一以寧神得一以靈谷得一以盈萬物得一以生侯王得一以爲天下貞其致之一也天無以清將恐裂地無以寧將恐發神無以靈將恐歇谷無以盈將恐竭萬物無以生將恐滅侯王無以貴高將恐蹶故貴以賤爲本高以下爲基是以侯王自稱孤寡不穀此非以賤爲本邪非乎故致數輿無輿不欲琭琭如玉珞珞如石反者道之動弱者道之用天下萬物生於有有生於無上士聞道勤而行之中士聞道若存若亡下士聞道大笑之不笑不足以爲道故建言有之明道若昧光而不耀進道若退夷道若纇上德若谷大白若辱廣德若不足建德若偷質真若渝大方無隅大器晚成大音希聲大象無形道隱無名夫唯道善貸且成道生一一生二二生三三生萬物萬物負陰而抱陽衝氣以爲和人之所惡唯孤寡不穀而王公以爲稱故物或損之而益或益之而損人之所教我亦教之強梁者不得其死吾將以爲教父天下之至柔馳騁天下之至堅無有入無閒間不言之教無爲之益天下希及之名與身孰親身與貨孰多得與亡孰病是故甚愛必大費多藏必厚亡知足不辱知止不殆可以長久大成若缺其用不弊大盈若衝其用不窮大直若屈大巧若拙大辯若訥大辯因物而言己無所造故若訥也躁勝寒靜勝熱清靜爲天下正天下有道卻走馬以糞天下無道戎馬生於郊禍莫大於不知足咎莫大於欲得故知足之足常足矣不出戶知天下不窺牖見天道其出彌遠其知彌少是以聖人不行而知不見而名不爲而成爲學日益爲道日損損之又損以至於無爲無爲而無不爲取天下常以無事及其有事不足以取天下第四十九章聖人無常心以百姓心爲心善者吾善之不善者吾亦善之德善信者吾信之不信者吾亦信之德信聖人在天下歙歙爲天下渾其心百姓皆注其耳目聖人皆孩之出生入死生之徒十有三死之徒十有三人之生動之死地亦十有三夫何故以其生生之厚蓋聞善攝生者陸行不遇兕虎入軍不被甲兵兕無所投其角虎無所措其爪兵無所容其刃夫何故以其無死地道生之德畜之物形之勢成之是以萬物莫不尊道而貴德道之尊德之貴夫莫之命而常自然故道生之德畜之長之育之亭之毒之養之覆之生而不有爲而不恃爲而不有長而不宰是謂玄德天下有始以爲天下母既得其母以知其子既知其子復守其母沒身不殆塞其兌閉其門終身不勤開其兌濟其事終身不救見小曰明守柔曰強用其光復歸其明無遺身殃是爲習常使我介然有知行於大道唯施是畏大道甚夷而民好徑朝甚除田甚蕪倉甚虛服文彩帶利劍厭飲食財貨有餘是爲誇盜非道也哉善建者不拔善抱者不脫子孫以祭祀不輟修之於身其德乃真修之於家其德乃餘修之於鄉其德乃長修之於國其德乃豐修之於天下其德乃普故以身觀身以家觀家以鄉觀鄉以國觀國以天下觀天下吾何以知天下然哉以此含德之厚比於赤子蜂蠆虺蛇不螫猛獸不據攫鳥不搏骨弱筋柔而握固未知牝牡之合而全作精之至也終日號而不嗄和之至也知和曰常知常曰明益生曰祥心使氣曰強物壯則老謂之不道不道早已知者不言言者不知塞其兌閉其門挫其銳解其分和其光同其塵是謂玄同故不可得而親不可得而疏不可得而利不可得而害不可得而貴不可得而賤故爲天下貴以正治國以奇用兵以無事取天下吾何以知其然哉以此天下多忌諱而民彌貧民多利器國家滋昏人多伎巧奇物滋起法令滋彰盜賊多有故聖人云我無爲而民自化我好靜而民自正我無事而民自富我無慾而民自樸其政悶悶其民淳淳其政察察其民缺缺禍兮福之所倚福兮禍之所伏孰知其極其無正正復爲奇善復爲妖人之迷其日固久是以聖人方而不割廉而不劌直而不肆光而不耀治人事天莫若嗇夫唯嗇是謂早服早服謂之重積德重積德則無不克無不克則莫知其極莫知其極可以有國有國之母可以長久是謂深根固柢長生久視之道治大國若烹小鮮以道蒞天下其鬼不神治大國則若烹小鮮以道蒞天下則其鬼不神也非其鬼不神其神不傷人非其神不傷人聖人亦不傷人夫兩不相傷故德交歸焉大國者下流天下之交天下之牝牝常以靜勝牡以靜爲下故大國以下小國則取小國小國以下大國則取大國故或下以取或下而取大國不過欲兼畜人小國不過欲入事人夫兩者各得其所欲大者宜爲下道者萬物之奧善人之寶不善人之所保美言可以市尊美行可以加人人之不善何棄之有故立天子置三公雖有拱璧以先駟馬不如坐進此道古之所以貴此道者何不曰以求得有罪以免邪故爲天下貴爲無爲事無事味無味大小多少報怨以德圖難於其易爲大於其細天下難事必作於易天下大事必作於細是以聖人終不爲大故能成其大夫輕諾必寡信多易必多難是以聖人猶難之故終無難矣其安易持其未兆易謀其脆易泮其微易散爲之於未有治之於未亂合抱之木生於毫末九層之臺起於壘土千里之行始於足下爲者敗之執者失之是以聖人無爲故無敗無執故無失民之從事常於幾成而敗之不慎終也慎終如始則無敗事是以聖人慾不欲不貴難得之貨學不學復衆人之所過以輔萬物之自然而不敢爲古之善爲道者非以明民將以愚之民之難治以其智多故以智治國國之賊不以智治國國之福知此兩者亦稽式常知稽式是謂玄德玄德深矣遠矣與物反矣然後乃至大順江海所以能爲百谷王者以其善下之故能爲百谷王是以欲上民必以言下之慾先民必以身後之是以聖人處上而民不重處前而民不害是以天下樂推而不厭以其不爭故天下莫能與之爭天下皆謂我道大似不肖夫唯大故似不肖若肖久矣其細也夫我有三寶持而保之一曰慈二曰儉三曰不敢爲天下先慈故能勇儉故能廣不敢爲天下先故能成器長今舍慈且勇舍儉且廣捨後且先死矣夫慈以戰則勝以守則固天將救之以慈衛之善爲士者不武善戰者不怒善勝敵者不與善用人者爲之下是謂不爭之德是謂用人之力是謂配天古之極用兵有言吾不敢爲主而爲客不敢進寸而退尺是謂行無行攘無臂扔無敵執無兵禍莫大於輕敵輕敵幾喪吾寶故抗兵相加哀者勝矣吾言甚易知甚易行天下莫能知莫能行言有宗事有君夫唯無知是以不我知知我者希則我者貴是以聖人被褐懷玉知不知上不知知病夫唯病病是以不病聖人不病以其病病是以不病民不畏威則大威至無狎其所居無厭其所生夫唯不厭是以不厭是以聖人自知不自見自愛不自貴故去彼取此勇於敢則殺勇於不敢則活此兩者或利或害天之所惡孰知其故是以聖人猶難之天之道不爭而善勝不言而善應不召而自來繟然而善謀天網恢恢疏而不失民不畏死奈何以死懼之若使民常畏死而爲奇者吾得執而殺之孰敢常有司殺者殺夫代司殺者殺是謂代大匠斲夫代大匠斲者希有不傷其手矣民之飢以其上食稅之多是以饑民之難治以其上之有爲是以難治民之輕死以其求生之厚是以輕死夫唯無以生爲者是賢於貴生人之生也柔弱其死也堅強萬物草木之生也柔脆其死也枯槁故堅強者死之徒柔弱者生之徒是以兵強則不勝木強則兵折強大處下柔弱處上天之道其猶張弓與高者抑之下者舉之有餘者損之不足者補之天之道損有餘而補不足人之道則不然損不足以奉有餘孰能有餘以奉天下唯有道者是以聖人爲而不恃功成而不處其不欲見賢天下莫柔弱於水而攻堅強者莫之能勝其無以易之弱之勝強柔之勝剛天下莫不知莫能行是以聖人云受國之垢是謂社稷主受國不祥是爲天下王正言若反和大怨必有餘怨安可以爲善是以聖人執左契而不責於人有德司契無德司徹天道無親常與善人小國寡民使有什伯之器而不用使民重死而不遠徙雖有舟輿無所乘之雖有甲兵無所陳之使人復結繩而用之甘其食美其服安其居樂其俗鄰國相望雞犬之聲相聞民至老死不相往來信言不美美言不信善者不辯辯者不善知者不博博者不知聖人不積既以爲人己愈有既以與人己愈多天之道利而不害聖人之道爲而不爭"
    pure_text_string_space = ""
    for i in pure_text_string:
        pure_text_string_space += i
        pure_text_string_space += " "

    wordcloud = WordCloud(
        font_path="MaShanZheng-Regular.ttf",
        width=800,
        height=600,
        background_color="white",
        min_font_size=10,
        # max_font_size=170,
        prefer_horizontal=1,
        # random_state=9,
        max_words=50,
    ).generate(pure_text_string_space)

    # plot the WordCloud image
    plt.figure(figsize=(8, 6), facecolor=None)
    plt.imshow(wordcloud)
    plt.axis("off")
    plt.tight_layout(pad=0)
    save_file = "wordcloud.png"
    plt.savefig(str(save_file))
    
if __name__ == "__main__":
    process_CN1()
